<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Aspera Connect disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.avenjamin.pkg.AsperaConnect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AsperaConnect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.avenjamin.download.AsperaConnect</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Aspera*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%dmgname%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
